Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.

data.aws_iam_policy_document.crossaccount_s3_read_policy_doc: Read complete after 0s [id=2025109738]
data.aws_route53_zone.accountstore: Read complete after 1s [id=Z02588511QFFECN4R9I5K]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.crossaccount_s3_read_role will be created
+ resource "aws_iam_role" "crossaccount_s3_read_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::825765422855:root"
                        }
                      + Sid       = "AllowSharedServicesAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CrossAccountS3ReadRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.crossaccount_s3_read_policy will be created
+ resource "aws_iam_role_policy" "crossaccount_s3_read_policy" {
      + id          = (known after apply)
      + name        = "ReadLogo"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-animeutopia-artifacts-bucket/*"
                      + Sid      = "AllowGetLogo"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
      + bucket                                 = "prod-animeutopia-media-bucket"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete_posts_after_1_week"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "posts/"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.media_bucket_encryption will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "media_bucket_encryption" {
      + bucket = "prod-animeutopia-media-bucket"
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "alias/aws/s3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.media_bucket_versioning will be created
+ resource "aws_s3_bucket_versioning" "media_bucket_versioning" {
      + bucket = "prod-animeutopia-media-bucket"
      + id     = (known after apply)
      + region = "us-east-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```